<div style="color:white;
           display:fill;
           border-radius:5px;
           background-color:#5642C5;
           font-size:200%;
           font-family:Arial;letter-spacing:0.5px">

<p width = 20%, style="padding: 10px;
              color:white;">
SQL: Subqueries
              
</p>
</div>

Data Science Cohort Live NYC Feb 2022
<p>Phase 1: Topic 6</p>
<br>
<br>

<div align = "right">
<img src="Images/flatiron-school-logo.png" align = "right" width="200"/>
</div>

Remember: 

SELECT queries return a new table.

Sometimes:

- Query a table.
- Filter/select/... on that query
- Return result of querying on the first query.

First query is a **subquery**.

Let's get into it with our handy dandy flights database!

In [3]:
import sqlite3
import numpy as np
import pandas as pd

# connect to flights database
con = sqlite3.connect('data/flights.db')

Example of a query containing a subquery:

In [4]:
pd.read_sql("""

SELECT *

FROM 

(SELECT name, 
     city,
     country,
     CAST(altitude as float) AS altitude
 
 FROM airports
 WHERE altitude > 10000) AS high_alt_airp


""", con)

                            name            city           country  altitude
0                         Goroka          Goroka  Papua New Guinea    5282.0
1                         Madang          Madang  Papua New Guinea      20.0
2                    Mount Hagen     Mount Hagen  Papua New Guinea    5388.0
3                         Nadzab          Nadzab  Papua New Guinea     239.0
4     Port Moresby Jacksons Intl    Port Moresby  Papua New Guinea     146.0
...                          ...             ...               ...       ...
7206                    Bus Stop      Hell-Bourg           Reunion    3000.0
7207                    Bus Stop         Salazie           Reunion    3000.0
7208              Prominent Hill  Prominent Hill         Australia     734.0
7209          Chatsworth Station      Chatsworth     United States     978.0
7210        Port McNeill Airport    Port McNeill            Canada     225.0

[7211 rows x 4 columns]